RULES = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Вам предстоит не только выполнять ежедневные задачи,
но и ухаживать за своим питомцем!
Для того, чтобы Ваш питомец был счастлив, нужно кормить его каждый день!
Для этого следуйте правилам:
1. Ставьте перед собой ежденевные цели!
2. Выполняйте цели и получайте бонусы в виде монеток!
3. Покупайте за монетки корм для своего питомца в магазине!
4. Кормите питомца, заходите почаще и он обязательно будет счастлив!
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"""

QUESTION = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Привет! 
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Если вы впервые в этом приложении, давайте зарегистрируемся! 
Если нет - вы можете войти в свой аккаунт.
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
1. Войти в существующий аккаунт
2. Зарегистрироваться"""

QUESTION_FOOD = """Хотите покормить своего питомца?
1. Да!
2. Чуть попозже!"""


OPTIONS_TODO = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
1. Обучение
2. Добавить задачу
3. Другие действия над задачей (удалить, отметить как завершенную, изменить)
4. Сортировка по статусу  
5. Сортировка по категории
6. Получить информацию о питомце
7. Купить продукты для питомца
8. Покормить питомца
9. Выйти из программы
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"""

OPTIONS_EDIT_TASK = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
0. Выйти в меню
1. Удалить задачу
2. Отметить как завершенную
3. Изменить
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"""

OPTIONS_UPDATE = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
0. Выйти в меню
1. Изменить имя
2. Изменить категорию
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"""

CATEGORY = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
1. Без категории
2. Обучение
3. Работа 
4. Личное
5. Путешествия
6. Ежедневное
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"""


class Animal:
    CAT = """
    /\__/\\
    (=^.^=)
    (")(")_/
    """

    DOG = """
    (\\__/)
    (' x ')
    c(")(")
    """

    TYPE_OF_PET = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Выберите тип своего питомца:
1. Котик
2. Собачка
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"""


TYPE_ITEM = ['FISH', 'BONE']

PROBLEM = """~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Вас нет в списке пользователей :(
Попробуйте зарегистрироваться!
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"""

CONTINEU_QUESTION = """Желаете продолжить?
1. Продолжить
2. Закрыть приложение"""
